a = [34, 54, 2]
print(a[0]) # 34
print(a[2]) # 2
b = [100, 40, 61, 0]
print(b[-1]) # 0
print(b[0:2]) # [100, 40]
print(b[2:-1]) # [61]
print(b[1:1000]) # [40, 61, 0]
print(b[0:]) # [100, 40, 61, 0]
print(b[0:3]) # [100, 40, 61]
print(b[:]) # [100, 40, 61, 0]
print(b[::2]) # [100, 61]
print(b[0:3:2]) # [100, 61]
print(b[::-1]) # [0, 61, 40, 100]
b[2] = 45 
print(b[2]) # 45
b[2:5] = 40, 50 
print(b) # [100, 40, 40, 50]
a = [123, 1, 3]
d = a # A в данном случае сыллка.
d[1] = 100
print(d) # [123, 100, 3]
print(a) # [123, 100, 3]
a = [1, 2, 3]
d = a[:] # Чтобы A не менялось.
d[1] = 100
print(d) # [1, 100, 3]
print(a) # [1, 2, 3]


